app/views/posts/_post.html.erb

        Posted at <%= post.created_at %><br>
        Posted by <%= User.find(post.sender_id).email rescue "" %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]