app/controllers/posts_controller.rb

INSERT INTO "posts" ("body", "created_at", "updated_at", "sender_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "dsdfsd"], ["created_at", "2021-08-27 09:49:10.085807"], ["updated_at", "2021-08-27 09:49:10.085807"], ["sender_id", 2]]
---
      def create
        @post = Post.new(post_params)
        respond_to do |format|
          if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "likes_count" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["likes_count", 1], ["updated_at", "2021-08-25 12:20:51.754117"], ["id", 3]]
---
      def like
        Post.find_by(id: params[:post_id]).increment(:likes_count).save ## New for this article

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "repost_count" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["repost_count", 1], ["updated_at", "2021-08-25 12:20:50.555494"], ["id", 3]]
---
      def repost
        Post.find_by(id: params[:post_id]).increment(:repost_count).save ## New for this article